do

function run(msg, matches)
  return [[ًں”کط¯ط³طھظˆط±ط§طھ ظپط§ط±ط³غŒ ط±ط¨ط§طھ:
___________________
#info
ًں”°ط§ط·ظ„ط§ط¹ط§طھ ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#infull
ًں”°ط§ط·ظ„ط§ط¹ط§طھ ع©ط§ظ…ظ„ ط®ظˆط¯ًں”°

#admins
ًں”°ظ„غŒط³طھ ط§ط¯ظ…غŒظ† ظ‡ط§غŒ ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#setadmin
ًں”°طھظ†ط·غŒظ… ط§ط¯ظ…غŒظ† ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#owner
ًں”°ظ…ط§ظ„ع© ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#setowner
ًں”°طھظ†ط¸غŒظ… ظ…ط§ظ„ع© ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#modlist
ًں”°ظ„غŒط³طھ ظ…ط¯غŒط±ط§ظ†ًں”°

#bots
ًں”°ظ„غŒط³طھ ط±ط¨ط§طھ ظ‡ط§ ط¯ط± ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#bot [lock|unlock]
ًں”°ظ‚ظپظ„|ط¨ط§ط² ع©ط±ط¯ظ† ط±ط¨ط§طھ ط¯ط± ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#who
ًں”°ظ„غŒط³طھ ع©ظ„ ع©ط§ط±ط¨ط±ط§ظ† ط¯ط± ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#block
ًں”°ط§ط®ط±ط§ط¬ ط´ط®طµ ط§ط² ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°
(ظˆط±ظˆط¯ ط´ط®طµ ط¨ظ‡ ظ„غŒط³طھ ظ…ط³ط¯ظˆط¯ط§ظ†)

#ban 
ًں”°ظ…ط³ط¯ظˆط¯ ع©ط±ط¯ظ† ط´ط®طµ ط§ط² ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#unban
ًں”°ط­ط°ظپ ظ…ط³ط¯ظˆط¯غŒ ط´ط®طµ ط§ط² ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#id
ًں”°ط§غŒط¯غŒ ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ ظˆ ط§غŒط¯غŒ ط´ط®طµًں”°

#id from
ًں”°ط§غŒط¯غŒ ط´ط®طµ ظپظˆط±ظˆط§ط±ط¯ ع©ظ†ظ†ط¯ظ‡ ظ¾غŒط§ظ…ًں”°

#kickme
ًں”°ط®ط±ظˆط¬ ط§ط² ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#promote [username|id]
ًں”°ط§ط±طھظ‚ط§ط¹ ع©ط§ط±ط¨ط± ط¨ظ‡ ظ…ط¯غŒط± ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#demote [username|id]
ًں”°ط­ط°ظپ ظ…ط¯غŒط± ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#setname [name]
ًں”°طھظ†ط¸غŒظ… ظ†ط§ظ… ع¯ط±ظˆظ‡ًں”°

#setphoto 
ًں”°طھظ†ط¸غŒظ… ط¹ع©ط³ ع¯ط±ظˆظ‡ًں”°

#setrules [rules]
ًں”°طھظ†ط¸غŒظ… ظ‚ظˆط§ظ†غŒظ† ع¯ط±ظˆظ‡ًں”°

#setabout [about]
ًں”°طھظ†ط¸غŒظ… ظ…ظˆط¶ظˆط¹ ع¯ط±ظˆظ‡ًں”°

#save [value] <text>
ًں”°غŒط§ط¯ط¯ط§ط´طھ ظ…طھظ† ظ‡ط§غŒ ع¯ط±ظˆظ‡ًں”°

#get [value]
ًں”°ظ…ط´ط§ظ‡ط¯ظ‡ غŒع© ظ…طھظ† ع¯ط±ظˆظ‡ًں”°

#newlink
ًں”°ط³ط§ط®طھ ظ„غŒظ†ع© ط¬ط¯غŒط¯ًں”°

#link
ًں”°ظ„غŒظ†ع© ظپط¹ظ„غŒ ع¯ط±ظˆظ‡ًں”°

#linkpv
ًں”°ظپط±ط³طھط§ط¯ظ† ظ„غŒظ†ع© ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ ط¯ط± ظ¾غŒظˆغŒًں”°

#rules
ًں”°ظ‚ظˆط§ظ†غŒظ† ع¯ط±â€Œظˆظ‡ًں”°

#lock [links|flood|spam|arabic|member|rtl|sticker|contacts|strict|tgservice|forward]
ًں”°ظ‚ظپظ„ ظ…ظˆط§ط±ط¯ ط¨ط§ظ„ط§ًں”°

#unlock [links|flood|spam|arabic|member|rtl|sticker|contacts|strict|tgservice|forward]
ًں”°ط¨ط§ط² ع©ط±ط¯ظ† ظ…ظˆط§ط±ط¯ ط¨ط§ظ„ط§ًں”°

#mute [all|audio|gifs|photo|video|text|service]
ًں”°ظ…ظˆطھ ظ…ظˆط§ط±ط¯ ط¨ط§ظ„ط§ًں”°

#unmute [all|audio|gifs|photo|video|text|service]
ًں”°ظ„ط؛ظˆ ظ…ظˆطھ ظ…ظˆط§ط±ط¯ ط¨ط§ظ„ط§ًں”°

#setflood [value]
ًں”°طھظ†ط¸غŒظ… ط§ظ†ط¯ط§ط²ظ‡ ط­ط³ط§ط³غŒطھ ط§ط³ظ¾ظ…ًں”°

#settings
ًں”°طھظ†ط¸غŒظ…ط§طھ ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#muteslist
ًں”°ظ„غŒط³طھ ظ…ظˆطھ ظ‡ط§غŒ ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#muteuser [username|id]
ًں”°ظ…ظˆطھ ظˆ ط¨ط§ط² ع©ط±ط¯ظ† ظ…ظˆطھ ط´ط®طµغŒًں”°

#mutelist
ًں”°ظ„غŒط³طھ ع©ط§ط±ط¨ط±ط§ظ† ظ…ظˆطھ ط´ط¯ظ‡ًں”°

#banlist 
ًں”°ظ„غŒط³طھ ظ…ط³ط¯ظˆط¯ط§ظ†ًں”°

#clean [rules|about|modlist|mutelist]
ًں”°ظ¾ط§ع© ع©ط±ط¯ظ† ظ…ظˆط§ط±ط¯ ط¨ط§ظ„ط§ًں”°

#del 
ًں”°ظ¾ط§ع© ع©ط±ط¯ظ… غŒع© ظ¾غŒط§ظ… ط¨ط§ ط±غŒظ¾ظ„غŒًں”°

#public [yes|no]
ًں”°ط®طµظˆطµغŒ ظˆ ط¹ظ…ظˆظ…غŒ ع©ط±ط¯ظ† ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#res [username]
ًں”°ط§غŒط¯غŒ ط´ط®طµ ط¨ط§ غŒظˆط²ط±ظ†غŒظ…ًں”°

#log
ًں”°ظ„ظˆع¯ ط³ظˆظ¾ط± ع¯ط±ظˆظ‡ًں”°

#addword [text]
ًں”°ظپغŒظ„طھط± ع©ط±ط¯ظ† ظ…طھظ†ًں”°

#badwords
ًں”°ظ„غŒط³طھ ظ…طھظ† ظ‡ط§غŒ ظپغŒظ„طھط± ط´ط¯ظ‡ًں”°

#rw [text]
ًں”°ط­ط°ظپ ظ…طھظ† ط§ط² ظ„غŒط³طھ ظپغŒظ„طھط± ظ‡ط§ًں”°

#clearbadwords
ًں”°ط­ط°ظپ طھظ…ط§ظ…غŒ ظپغŒظ„طھط± ظ‡ط§ًں”°

#me
ًں”°ظ…ط´ط®طµط§طھ ط´ظ…ط§ًں”°

#tophoto
ًں”°طھط¨ط¯غŒظ„ ط§ط³طھغŒع©ط± ط¨ظ‡ ط¹ع©ط³ًں”°

#tosticker 
ًں”°طھط¨ط¯غŒظ„ ط¹ع©ط³ ط¨ظ‡ ط§ط³طھغŒع©ط±ًں”°

#conv [text]
ًں”°ط³ط§ط®طھ ط¹ع©ط³ ظ†ظˆط´طھظ‡ًں”°

#sticker [text]
ًں”°ط³ط§ط®طھ ط§ط³طھغŒع©ط± ظ†ظˆط´طھظ‡ًں”°

#wai
ًں”°ظ…ط´ط§ظ‡ط¯ظ‡ غŒ ظ…ظ‚ط§ظ… ط´ظ…ط§ًں”°

#voice [text]
ًں”°طھط¨ط¯غŒظ„ ظ…طھظ† ط¨ظ‡ طµط¯ط§ًں”°

#support 
ًں”°ط¯ط±غŒط§ظپطھ ظ„غŒظ†ع© ط³ط§ظ¾ظˆط±طھ ط±ط¨ط§طھًں”°

#clan [tag]
ًں”°ظ…ط´ط®طµط§طھ ع©ظ„ظ† ط´ظ…ط§ًں”°

#nerkh
ًں”°ظ†ط±ط® ع¯ط±ظˆظ‡ ط¨ط§ ط±ط¨ط§طھًں”°

#weather [city]
ًں”°ط§ط¨ ظˆ ظ‡ظˆط§غŒ ط´ظ‡ط± ظ…ظˆط±ط¯ ظ†ط¸ط±ًں”°
___________________
*ط´ظ…ط§ ظ…غŒطھظˆط§ظ†غŒط¯ ط§ط² ط¹ظ„ط§ظ…طھ ظ‡ط§غŒ (!)(/)(#)*
channel: @WaderTgTeam]]

end

return {
  description = " bot help", 
  usage = "help",
  patterns = {
    "^[!/#]helpfa$"
  }, 
  run = run 
}

