do

function run(msg, matches)
  return "ًں’°طھط¹ط±ظپظ‡ ط¯ط±غŒط§ظپطھ ع¯ط±ظˆظ‡ ط¶ط¯ ط§ط³ظ¾ظ… ط¨ط§ ط±ط¨ط§طھ WaderTG\nظ…ط¨ظ„ط؛ ظ‚ط§ط¨ظ„ ظ¾ط±ط¯ط§ط®طھًں’¶5,000 طھظˆظ…ظ†\nâڑ ï¸ڈظ†ع©طھظ‡ ظ…ظ‡ظ… ع©ط³ط§ظ†غŒ ع©ظ‡ ع¯ط±ظˆظ‡ ط¯ط§ط±ظ†ط¯ ع©ظ‡ ط§ط¹ط¶ط§غŒ ط¢ظ† ط¨ط§ظ„ط§غŒ100 ظ†ظپط± ط§ط³طھ\nط±ط¨ط§طھ ط¨ظ‡ ع¯ط±ظˆظ‡ ط´ظ…ط§ ط¨ظ‡ طµظˆط±طھ ط±ط§غŒع¯ط§ظ† ط§ط¶ط§ظپظ‡ ظ…غŒط´ظˆط¯ًںکژ\nط§ط¯ظ…غŒظ† ظ‡ط§غŒ ط±ط¨ط§طھ WaderTGط¬ظ‡طھ ط¯ط± ط®ظˆط§ط³طھ ع¯ط±ظˆظ‡ ط¶ط¯ ط§ط³ظ¾ظ…\n@mohammadsdi4799\n@iphonei\n@AMiN1779\n@Oo_hamed_ice_fuckeram_Oo\n"
end

return {
  description = " bot nerkh", 
  usage = "nerkh",
  patterns = {
    "^nerkh$",
    "^[!/#]nerkh$"
  }, 
  run = run 
}

end
